mdanh2002/projects/dsmp3/dspic33ep_dokump3_final_v2/dspic33ep_dokump3_final_v2.X/i2c_lib.c
#include <xc.h>
#include "config.h"
#include "i2c_lib.h"

// provide some rest time to reduce I2C clock speed
void i2c_dly(void)
{   
    // delay longer in fastest mode, compared with 8MHz mode
    if (getCurOperatingMode() == 0) // OP_MODE_FASTEST, declared in type_const.h, but we can't import it here due to duplicate defines, just hard-code
    {        
        unsigned char c;
        for (c = 0; c < 8; c++)
        {
            Nop();
        }
    }
    else {
        // slow mode
        Nop();
        Nop();
        Nop();
        Nop();
        Nop();
        Nop();
    }
}

void i2c_start(void)
{
  SDA = 1;             // i2c start bit sequence
  i2c_dly();
  SCL = 1;
  i2c_dly();
  SDA = 0;
  i2c_dly();
  SCL = 0;
  i2c_dly();
}

void i2c_stop(void)
{
  SDA = 0;             // i2c stop bit sequence
  i2c_dly();
  SCL = 1;
  i2c_dly();
  SDA = 1;
  i2c_dly();
}

unsigned char i2c_rx(char ack)
{
	unsigned char x;
	unsigned char d=0;
	int count = 0;

  SDA = 1;  
  for(x=0; x<8; x++) {
    d <<= 1;

     do {
      SCL = 1;
	  count++;
     }
     while (SCL_IN==0 && count < I2C_WAIT_TIMEOUT);
	i2c_dly();
    
    if(SDA_IN) d |= 1;
    SCL = 0;
  } 
  if(ack) SDA = 0;
  else SDA = 1;
  SCL = 1;
  i2c_dly();             // send (N)ACK bit
  SCL = 0;
  SDA = 1;
  return d;
}

char i2c_write(unsigned char d)
{
char x;
	 char b;
  for(x=8; x; x--) {
    if(d&0x80) SDA = 1;
    else SDA = 0;
    SCL = 1;
    d <<= 1;
	i2c_dly();
    SCL = 0;
  }
  SDA = 1;
  SCL = 1;
  i2c_dly();
  b = SDA_IN;          // possible ACK bit
  SCL = 0;
  return b;
}
